{
	"default": {
		"parentText": "Quantum computers \nQuantum computers (QC) promise to solve certain numerical problems significantly faster than classical computers. Different technological approaches are being pursued, though in all cases operating the actual QC-chip depends heavily on peripheral classical high-tech. \nThis model displays a typical superconducting QC setup within a dilution refrigerator for achieving stable operation conditions at millikelvin (mK) temperatures. This poses a great technological challenge for ultra-low power electronics operating at cryogenic temperatures. \nForschungszentrum Jülich (FZJ) forms a national focus of QC research ranging from fundamental quantum science to hardware development to applications. The aim of FZJ is to establish a research, development and application ecosystem with academic and industrial partners."
	},
	"plates": {
		"parentText": "Gold-plated disks opertating at different temperatures. \nThe cooling, coming from the central helium pipe, propagates from the center towards the edges. Copper a is useful material largely used in cryogenics due to its high thermal conductivity. \nGold-plated surfaces provides a low emissivity, useful for thermal radiation rejection. It also prevents oxidation of the plated material, thus improving the quality of the thermal contacts on the surface and avoiding that the thermal conductivity of the bulk material decreases with time (oxygen would diffuse inside the bulk).",
		"objects": {
			"plate_0": {
				"name": "~50K (-223°C)"
			},
			"plate_1": {
				"name": "~4K (-269°C)"
			},
			"plate_2": {
				"name": "~800mK (-272,35°C)"
			},
			"plate_3": {
				"name": "90mK (-273,06°C"
			},
			"plate_4": {
				"name": "10mK (-273,14°C)"
			}
		}
	},
	"control_circuit": {
		"parentText": "TODO",
		"objects": {
			"cables_control": {
				"name": "FZJ",
				"text": "TODO"
			},
			"filter_frequency": {
				"name": "FZJ",
				"text": "TODO"
			}
		}
	},
	"measuring_circuit": {
		"parentText": "TODO",
		"objects": {
			"power_supply": {
				"name": "power supply",
				"text": "TODO"
			},
			"HEMTS": {
				"name": "HEMTs",
				"text": "Similar to the TWPA, the HEMT (high electron mobility transistor) further amplifies readout signals. \nEach HEMT is connected to a DC power source (are there also AC sources?), also shown here."
			},
			"cables_measuring": {
				"name": "coaxial cables",
				"text": "Coaxial cables, partly superconducting, transmit microwave signals. \nCables are bent to prevent damage during thermal contraction or expansion, occuring each time the fridge is cooled down or warmed up. All cables are therefore either flexible or semi-rigid. \nThere are two main types: (i) control cables, which are used for data processing, and (ii) readout cables, used to obtain an output at the end of a calculation."
			},
			"TWPA": {
				"name": "TWPA",
				"text": "The TWPA (traveling wave parameteric amplifier) amplifies readout signals with near-quantum limited amplification."
			},
			"directional_coupler": {
				"name": "directional coupler",
				"text": "Directional couplers, similar to frequency filters and RF isolators (circulators with one port terminated), protect QPU from unwanted external signals."
			},
			"isolator": {
				"name": "?",
				"text": "TODO"
			}
		}
	},
	"helium_system": {
		"parentText": "TODO",
		"objects": {
			"gas_pipe": {
				"name": "heluim gas pipe",
				"text": "Helium gas pipe: internal (supply) and external (discharge) lines.\n The closed, or circular, flow of a mixture of He-3 and He-4 enables stable cryogenic temperatures. An external gas system consisting of pumps, helium purifiers and gas condensers, precool the He-3 gas [e.g., using liquid nitrogen gas (at 77 K) and liquid He-4 (at 4.2 K)] before passing it into the gas pip inside the cryostat."
			},
			"still": {
				"name": "still",
				"text": "The still evaporates helium gas, a crucial step in the cooling process."
			},
			"heat_exchanger_round": {
				"name": "heat exchanger round",
				"text": "Two types of heat exchangers cool down incoming warm helium gas."
			},
			"heat_exchanger_steps": {
				"name": "heat exchanger steps",
				"text": "Two types of heat exchangers cool down incoming warm helium gas."
			},
			"mixing_chamber": {
				"name": "mixing chamber",
				"text": "In the mixing chamber, cooling power is generated by changing the concentration of helium isotopes through evaporation."
			}
		}
	},
	"single": {
		"objects": {
			"qpu": {
				"name": "QPU",
				"text": "Quantum chip (or quantum processing unit, short QPU), hosting qubits, performs central quantum processing tasks. \nIn the present setup, qubits and their couplers consist of superconducting circuits comprising mainly capacitors, resonators and so-called Josephson junctions.  Most such circuits are made of aluminum, a superconductor with a critical temperature of 1.75 Kelvin (or approximately -271 degrees Celsius)."
			},
			"plaque": {
				"name": "FZJ",
				"text": "TODO"
			},
			"cryogenic_circuitry": {
				"name": "cryogenic circuitry",
				"text": "Attached to lowest disk: cryogenic circuitry for QPU manipulation and readout.\nSpecially designed circuit elements are required to work at these extremely low temperatures."
			},
			"open_cable": {
				"name": "open coaxial cable",
				"text": "Open coaxial cable displaying internal conductor and dielectric. \nCoaxial cables consist of internal and external conductors, separated by a dielectric (or an insulator)."
			}
		}
	}
}
