{
	"default": {
		"parentText": "**Model of superconducting quantum computer** \nQuantum computers promise to solve certain numerical problems significantly faster than classical computers. Different technological approaches are being pursued, though in all cases operating the quantum-chip depends crucially on peripheral classical high-tech. \nThis model displays a typical superconducting quantum computer setup within a dilution refrigerator, which provides stable operation conditions at cryogenic temperatures. This poses a great technological challenge for electronics operating at such low temperatures. \nForschungszentrum Jülich (FZJ) forms a national focus of QC research ranging from fundamental quantum science to hardware development to applications. The aim of FZJ is to establish a research, development and application ecosystem with academic and industrial partners."
	},
	"plates": {
		"parentText": "*Gold-plated copper disks* operating at different cryogenic temperatures. These disks form the framework of the setup:  all parts of the quantum computer are attached to these plates, and they are cooled to extremely low, or cryogenic temperatures by being in contact with the plates.",
		"parentTextDetails": "The cooling power is distributed via the copper disks from the central helium pipe towards the edges. Copper a is useful material largely used in cryogenics due to its high thermal conductivity. Gold-plated surfaces shield the disks from absorbing thermal radiation. They also prevent oxidation of the plated material, thereby improving the quality of the thermal contacts on the surface and avoiding that the thermal conductivity of the bulk material decreases with time (without such plating, oxygen would diffuse inside the bulk).",
		"objects": {
			"plate_0": {
				"name": "~50K (-223°C)"
			},
			"plate_1": {
				"name": "~4K (-269°C)"
			},
			"plate_2": {
				"name": "~800mK (-272,35°C)"
			},
			"plate_3": {
				"name": "90mK (-273,06°C)"
			},
			"plate_4": {
				"name": "10mK (-273,14°C)"
			}
		}
	},
	"electronic_circuit": {
		"parentText": "*Electronic circuits* used for quantum information processing.  These circuits allow to process data by sending electronic signals as dictated by quantum computing programs written by the user.",
		"parentTextDetails": "Quantum computations and readout are carried out by the application of microwaves, which are inserted via electronic circuits consisting of coaxial cables (some of which are made from superconducting material), different kind of microwave modules and power supply cables. The connection to the external world goes through the topmost disk. Specially designed circuit elements are required to work at cryogenic temperatures.\nCables are bent to prevent damage during thermal contraction or expansion, occuring each time the fridge is cooled down or warmed up. All cables are therefore either flexible or semi-rigid.",
		"objects": {
			"cables_control": {
				"name": "Control cables",
				"text": "Coaxial cables transmit microwaves at Gigaherz frequencies from top to bottomw to carry out quantum computations. The microwaves are generated by classical hardware such as microwave generators outside the cryostat."
			},
			"cables_measuring": {
				"name": "Measuring cables",
				"text": "Coaxial cables, partly superconducting, transmit microwave signals from top to bottom (for triggering readout) and in the reverse direction (for carrying readout signals from the QPU to the user). Readout signals need to be analysed by classical hardware outside the cryostat."
			},
			"qpu": {
				"name": "QPU",
				"text": "Quantum chip (or quantum processing unit, short QPU), hosting qubits, performs central quantum information processing tasks. In the present setup, the physical qubits and their couplers consist of superconducting circuits comprising mainly capacitors, resonators and so-called Josephson junctions.  Current circuits of this kind are mostly made of aluminum, a superconductor with a critical temperature of 1.75 Kelvin (or approximately -271 degrees Celsius)."
			},
			"filter_frequency": {
				"name": "Bandpass filters",
				"text": "High-pass and low-pass frequency filters protect the QPU from unwanted external high- and/or low-frequency noise."
			},
			"TWPA": {
				"name": "TWPA",
				"text": "The TWPA (traveling wave parameteric amplifier) amplifies readout signals with near-quantum limited amplification."
			},
			"HEMTS": {
				"name": "HEMTs",
				"text": "Similar to the TWPA, the HEMT (high electron mobility transistor) further amplifies readout signals. \nEach HEMT is connected to a DC power source (are there also AC sources?), also shown here."
			},
			"power_supply": {
				"name": "Power supply cables",
				"text": "These cables provide DC power supply for the HEMTs."
			},
			"isolator": {
				"name": "Microwave isolators",
				"text": "Microwave isolators, or microwave circulators with one port terminated, prevent unwanted signals from disturbing the fragile quantum computations on the quantum processor, or QPU."
			},
			"directional_coupler": {
				"name": "Directional coupler",
				"text": "Directional couplers, similar to frequency filters and bandpass isolators, further protect the QPU from unwanted external signals."
			},
			"open_cable": {
				"name": "Open coaxial cable",
				"text": "Open coaxial cable displaying internal conductor and dielectric"
			}
		}
	},
	"helium_system": {
		"parentText": "*Helium gas system* providing stable cryogenic temperatures.",
		"parentTextDetails": "TODO",
		"objects": {
			"gas_pipe": {
				"name": "Heluim gas pipe",
				"text": "The Helium gas pipe consists of internal (supply) and external (discharge) lines. The continuous circular flow of a mixture of He-3 and He-4 enables stable cryogenic temperatures. An external gas system consisting of pumps, helium purifiers and gas condensers, precool the He-3 gas [e.g., using liquid nitrogen gas (at 77 K) and liquid He-4 (at 4.2 K)] before passing it into the gas pip inside the cryostat through the topmost disk."
			},
			"still": {
				"name": "still",
				"text": "The still evaporates helium, mainly helium-3, a crucial step in the cooling process.",
				"textDetails": "still"
			},
			"heat_exchanger_round": {
				"name": "Continuous heat exchanger",
				"text": "The continuous helical heat exchanger helps cool down incoming warm helium gas. It consists of two concentric capillaries, and heat is exchanged via the interface. This type of heat exchanger does not provide enough surface area to reach extremely low temperatures."
			},
			"heat_exchanger_steps": {
				"name": "Step heat exchanger",
				"text": "In each 'step' there are two metal tubes welded together.  The tubes are filled with sintered metal, which creates a very large surface area, which allows for reaching extremely low temperatures of less than 10 Millikelvin."
			},
			"mixing_chamber": {
				"name": "mixing chamber",
				"text": "In the mixing chamber, cooling power is generated by mixing the concentrations of helium isotopes through evaporation."
			}
		}
	},
	"single": {
		"objects": {
			"plaque": {
				"name": "Creaters / Developers / (Authors)",
				"text": "Sebastian Droege and Daniel Zeuch, Forschungszentrum Jülich, Peter Grünberg Institute (PGI-Science Office).  S.D. developed the 3D animation, D.Z. provided the technical contents and supervised the project.  (Good or bad?  Input Team Science Office?)"
			},
			"credits": {
				"name": "Credits",
				"text": "We would like to thank the Peter Schüffelgen and Roudy Hanna of PGI-9 for letting us take a panorama picture of their laboratory for creating a background of the animation. We also thank Anna Bauer, Wolfgang Speier and Jan Timper for valuable discussions on how to present this animation. \nD.Z. is grateful for many stimulating discussions about the experimental setup of a superconducting quantum computer with many scientists at Forschungszentrum Jülich of PGI-9, PGI-11, PGI-13, most noteworthy with Pavel Bushev, Benedikt Frohn, Roudy Hanna, Albert Hertel, Markus Jerger, Andrea Raccanelli, Anne Schmidt and Frank Wilhelm-Mauch."
			}
		}
	}
}
