{
	"default": {
		"name": "Model of superconducting quantum computer",
		"parentText": "Quantum computers are expected to solve certain numerical problems significantly faster than classical computers. Various technological approaches are being pursued in laboratories worldwide. In all cases operating the quantum processor depends crucially on peripheral classical high-tech. \nThe present model displays a typical superconducting quantum computer setup. The shown hardware is placed inside a dilution refrigerator, or cryostat, which provides stable operation conditions at cryogenic temperatures, though there are more special electronic devices outside the cryostat. This entire setup poses a great technological challenge: the integration of low temperature electronics, which protect the fickle quantum states on the quantum processor from external noise and enable high-fidelity quantum computing. \nForschungszentrum Jülich forms a national focus of quantum computing research ranging from fundamental quantum science to hardware development to applications. The aim of the Forschungszentrum is to establish a research, development and application ecosystem with academic and industrial partners.",
		"seq": 0
	},
	"plates": {
		"name": "Bulk of cryostat",
		"parentText": "*Gold-plated copper disks* operating at different cryogenic temperatures. These disks form the framework of the setup:  all parts of the quantum computer are attached to these plates, and they are cooled to extremely low, or cryogenic temperatures by being in contact with the plates.",
		"parentTextDetails": "The cooling power is distributed via the copper disks from the central helium pipe towards the edges. Copper a is useful material largely used in cryogenics due to its high thermal conductivity. Gold-plated surfaces shield the disks from absorbing thermal radiation. They also prevent oxidation of the plated material, thereby improving the quality of the thermal contacts on the surface and avoiding that the thermal conductivity of the bulk material decreases with time (without such plating, oxygen would diffuse inside the bulk).",
		"seq": 1,
		"objects": {
			"plate_0": {
				"name": "~50K (-223°C)"
			},
			"plate_1": {
				"name": "~4K (-269°C)"
			},
			"plate_2": {
				"name": "~800mK (-272,35°C)"
			},
			"plate_3": {
				"name": "90mK (-273,06°C)"
			},
			"plate_4": {
				"name": "10mK (-273,14°C)"
			}
		}
	},
	"electronic_circuit": {
		"name": "Electronic Circuits",
		"parentText": "Electronic circuits used for processing of quantum information. These circuits allow to process data by sending electronic signals as dictated by quantum computing programs written by the user.",
		"parentTextDetails": "Quantum computations and readout are carried out by the application of microwaves, which are inserted via electronic circuits consisting of coaxial cables (some of which are made from superconducting material), different kind of microwave modules and power supply cables. The connection to the external world goes through the topmost disk. Specially designed circuit elements are required to work at cryogenic temperatures.\nCables are bent to prevent damage during thermal contraction or expansion, occuring each time the fridge is cooled down or warmed up. All cables are therefore either flexible or semi-rigid.",
		"seq": 2,
		"objects": {
			"cables_control": {
				"name": "Control cables",
				"text": "Cables used for data processing.",
				"textDetails": "Coaxial cables transmit microwaves at Gigaherz frequencies from top to bottomw to carry out quantum computations. The microwaves are generated by classical hardware such as microwave generators outside the cryostat.",
				"seq": 3
			},
			"cables_measuring": {
				"name": "Measuring cables",
				"text": "Cables used for readout.",
				"textDetails": "Coaxial cables, partly superconducting, transmit microwave signals from top to bottom (for triggering readout) and in the reverse direction (for carrying readout signals from the QPU to the user). Readout signals need to be analysed by classical hardware outside the cryostat.",
				"seq": 4
			},

			"filter_frequency": {
				"name": "Bandpass filters",
				"text": "High-pass and low-pass frequency filters protect the QPU from unwanted external high- and/or low-frequency noise.",
				"seq": 5
			},
			"TWPA": {
				"name": "TWPA",
				"text": "The TWPA (traveling wave parameteric amplifier) amplifies readout signals with near-quantum limited amplification.",
				"seq": 6
			},
			"HEMTS": {
				"name": "HEMTs",
				"text": "Similar to the TWPA, the HEMT (high electron mobility transistor) further amplifies readout signals. \nEach HEMT is connected to a DC power source (are there also AC sources?), also shown here.",
				"seq": 7
			},
			"power_supply": {
				"name": "Power supply Cables",
				"text": "These cables provide DC power supply for the HEMTs.",
				"seq": 8
			},
			"isolator": {
				"name": "Microwave Isolators",
				"text": "Microwave isolators, or microwave circulators with one port terminated, prevent unwanted signals from disturbing the fragile quantum computations on the quantum processor, or QPU.",
				"seq": 9
			},
			"directional_coupler": {
				"name": "Directional Coupler",
				"text": "Directional couplers, similar to frequency filters and bandpass isolators, further protect the QPU from unwanted external signals.",
				"seq": 10
			},
			"open_cable": {
				"name": "Open Coaxial Cable",
				"text": "Open coaxial cable displaying internal conductor and dielectric",
				"seq": 11
			}
		}
	},
	"helium_system": {
		"name": "Helium Gas System",
		"parentText": "Helium gas system providing stable cryogenic temperatures. The basic cooling process is based on evaporation of helium gas, and is similar to evaporative cooling using water (https://en.wikipedia.org/wiki/Evaporative_cooler).",
		"parentTextDetails": "The continuous circular flow of a mixture of He-3 and He-4 enables stable cryogenic temperatures. An external gas system consisting of pumps, helium purifiers and gas condensers, precool the He-3 gas [e.g., using liquid nitrogen gas (at 77 K) and liquid He-4 (at 4.2 K)] before passing it into the gas pip inside the cryostat through the topmost disk.",
		"seq": 12,
		"objects": {
			"gas_pipe": {
				"name": "Helium Gas Pipe",
				"text": "The Helium gas pipe consists of internal (supply) and external (discharge) lines. The internal line pumps highly concentrated helium gas into internal cooling cycle, while the outer line deducts warmer gas from the cryostat into the external helium system for recycling.",
				"seq": 13
			},
			"still": {
				"name": "Still",
				"text": "The still evaporates helium, mainly helium-3, which is then deducted from the cryostat for reprocessing in the helium cycle.  This removal of He-3 a crucial step in the cooling process, since it balances the increase of He-3 that occurs in the mixing chamber.",
				"seq": 14
			},
			"heat_exchanger_round": {
				"name": "Continuous Heat Exchanger",
				"text": "The continuous helical heat exchanger helps cool down incoming warm helium gas.",
				"textDetails": "It consists of two concentric capillaries, and heat is exchanged via the interface. This type of heat exchanger typically does not provide enough surface area to reach temperatures below 30 mK.",
				"seq": 15
			},
			"heat_exchanger_steps": {
				"name": "Step Heat Exchanger",
				"text": "The step heat exchanger cools down incoming gas. It thus acts similarly to the continuous heat exchanger, however it is significantly more efficient.",
				"textDetails": "In each 'step' there are two metal tubes carrying helium gas that have been welded together. The walls of these tubes are made from sintered metal thus providing a very large surface area, which is necessary for reaching extremely low temperatures of less than 10 Millikelvin.",
				"seq": 16
			},
			"mixing_chamber": {
				"name": "Mixing Chamber",
				"text": "In the mixing chamber, cooling power is generated by evaporating helium-3 into a helium-4 environment. This step is comparable to the cooling process in an evaporative cooler.",
				"seq": 17
			}
		}
	},
	"single": {
		"objects": {
			"plaque": {
				"name": "Creaters / Developers / (Authors)?",
				"text": "Sebastian Droege and Daniel Zeuch, Forschungszentrum Jülich, Peter Grünberg Institute (PGI-Science Office). S.D. developed the 3D animation, D.Z. provided the technical contents and supervised the project. Last changes:  2022. (Good or bad?  Input Team Science Office?)",
				"seq": 18
			},
			"credits": {
				"name": "Credits",
				"text": "We would like to thank the Peter Schüffelgen and Roudy Hanna of PGI-9 for letting us take a panorama picture of their laboratory for creating a background of the animation. We also thank Anna Bauer, Wolfgang Speier and Jan Timper for valuable discussions on how to present this animation. \nD.Z. is grateful for many stimulating discussions about the experimental setup of a superconducting quantum computer with many scientists at Forschungszentrum Jülich of PGI-9, PGI-11, PGI-13, most noteworthy with Pavel Bushev, Benedikt Frohn, Roudy Hanna, Albert Hertel, Markus Jerger, Andrea Raccanelli, Anne Schmidt and Frank Wilhelm-Mauch.",
				"seq": 19
			},
			"qpu": {
				"name": "QPU",
				"text": "Quantum processor (or quantum processing unit, short QPU), hosting qubits, performs central quantum information processing tasks. In the present setup, the physical qubits and their couplers consist of superconducting circuits comprising mainly capacitors, resonators and so-called Josephson junctions. Current circuits of this kind are mostly made of aluminum, a superconductor with a critical temperature of 1.75 Kelvin (or approximately -271 degrees Celsius).",
				"seq": 20
			}
		}
	}
}
